cases/catalyticSimpleFOAM_v0.1/Case01-Turbulent/constant/solverOptions
/*/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      solverOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    viscositySpecies    on;

    diffusivitySpecies  on;

    energyEquation   off;

    homogeneousReactions on;

    inertSpecie N2;

    gasProperties       "/home/chimica2/cuoci/MyRuns/CatalyticFOAM/Kinetics/H2onRh_UBI_2008/idealgas.bin";
    gasKinetics         "/home/chimica2/cuoci/MyRuns/CatalyticFOAM/Kinetics/H2onRh_UBI_2008/reactions.bin";
    surfaceProperties   "/home/chimica2/cuoci/MyRuns/CatalyticFOAM/Kinetics/H2onRh_UBI_2008/surface.bin";

    viscosityMixingLaw  Herning;

    viscosity    viscosity   [ 1 -1 -1 0 0 0 0 ] 1.8e-5;
    diffusivity  diffusivity [ 0  2 -1 0 0 0 0 ] 1.8e-5;

    spark off;

    convectiveHeatFlux off;
    coolantTemperature 298.;
    globalExchangeCoefficient 100.;

    AlfaCatalyst 1.5668;

    massFractionsTolerance 1.e-9;

    inputOutputFractionsType molar;

    inputOutputFractionsType molar;

    radiativeHeatTransfer   off;
    environmentTemperature 300.;


// ************************************************************************* //


